content/roam/20211020132210-veos_compute.org
:PROPERTIES:
:ID:       23f591f8-a162-4145-b6f7-0ef92399f039
:END:
#+title: veos-compute
[[./20210830182658-veos.org][veos]]

[[./20210917084801-ddpg.org][DDPG]]

* model
** actor
+ input layer 5x30
+ 1st hidden layer 256
+ 2nd hidden layer 256
+ output layer 85
** critic
+ input state layer: 5x30
+ 1st input hidden layer: 16
+ 2nd input hidden layer: 32
+ input action layer: 17x5
+ input action layer: 32
+ (concat action+state input layer) 64
+ 1st hidden layer 256
+ 2nd hidden layer 256
+ output 1
* memory
+ actor: 150+256+256+85 = 747
+ critic: (150+16+32)+(85+32)+256+256+1=3318
+ sum:
  + neurons (747+3318)*4 (float32)=16260 16.26kB
  + weights ((150*256+256*256+256*85) + (150*16+16*32+85*32+64*256+256*256+256))*4 = (125696 + 87808)*4 = 213504*4= 854016 = 854kB

* compute
+ (125696+87808)*2*3*6/3 = 2.56 megaFlops
