docs/20211020132210-veos_compute.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>veos-compute</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">veos-compute</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org17b348c">model</a>
<ul>
<li><a href="#org16b3d03">actor</a></li>
<li><a href="#org3e71722">critic</a></li>
</ul>
</li>
<li><a href="#org2ac8a7e">memory</a></li>
<li><a href="#orge6a2ca0">compute</a></li>
</ul>
</div>
</div>
<p>
<a href="./20210830182658-veos.html">veos</a>
</p>

<p>
<a href="./20210917084801-ddpg.html">DDPG</a>
</p>

<div id="outline-container-org17b348c" class="outline-2">
<h2 id="org17b348c">model</h2>
<div class="outline-text-2" id="text-org17b348c">
</div>
<div id="outline-container-org16b3d03" class="outline-3">
<h3 id="org16b3d03">actor</h3>
<div class="outline-text-3" id="text-org16b3d03">
<ul class="org-ul">
<li>input layer 5x30</li>
<li>1st hidden layer 256</li>
<li>2nd hidden layer 256</li>
<li>output layer 85</li>
</ul>
</div>
</div>
<div id="outline-container-org3e71722" class="outline-3">
<h3 id="org3e71722">critic</h3>
<div class="outline-text-3" id="text-org3e71722">
<ul class="org-ul">
<li>input state layer: 5x30</li>
<li>1st input hidden layer: 16</li>
<li>2nd input hidden layer: 32</li>
<li>input action layer: 17x5</li>
<li>input action layer: 32</li>
<li>(concat action+state input layer) 64</li>
<li>1st hidden layer 256</li>
<li>2nd hidden layer 256</li>
<li>output 1</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2ac8a7e" class="outline-2">
<h2 id="org2ac8a7e">memory</h2>
<div class="outline-text-2" id="text-org2ac8a7e">
<ul class="org-ul">
<li>actor: 150+256+256+85 = 747</li>
<li>critic: (150+16+32)+(85+32)+256+256+1=3318</li>
<li>sum:
<ul class="org-ul">
<li>neurons (747+3318)*4 (float32)=16260 16.26kB</li>
<li>weights ((150*256+256*256+256*85) + (150*16+16*32+85*32+64*256+256*256+256))*4 = (125696 + 87808)*4 = 213504*4= 854016 = 854kB</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge6a2ca0" class="outline-2">
<h2 id="orge6a2ca0">compute</h2>
<div class="outline-text-2" id="text-orge6a2ca0">
<ul class="org-ul">
<li>(125696+87808)*2*3*6/3 = 2.56 megaFlops</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.7)</p>
</div>
</body>
</html>